Revit 2027 API
Application.ApplicationInitialized Event
 Subscribe to this event to get notified after the Revit application has been initialized
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<ApplicationInitializedEventArgs> ApplicationInitialized
Public Event ApplicationInitialized As EventHandler(Of ApplicationInitializedEventArgs)
public:
 event EventHandler<ApplicationInitializedEventArgs^>^ ApplicationInitialized {
	void add (EventHandler<ApplicationInitializedEventArgs^>^ value);
	void remove (EventHandler<ApplicationInitializedEventArgs^>^ value);
}
member ApplicationInitialized : IEvent<EventHandler<ApplicationInitializedEventArgs>,
    ApplicationInitializedEventArgs>
Value
EventHandler<ApplicationInitializedEventArgs>
Remarks
 The event is raised after Revit was launched as fully initialized, including initialization of external applications.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace